<html>
<head>
  <title>OR-Alpha Helpfile</title>
</head>
	<body bgcolor="00BFFF" bgproperties="fixed">

		<h2 align="left">
			<font Face="arial" SIZE="7" color="FFFFFF">Willkommen in der OR-Alpha Hilfe!</font></h2>

		<hr color="ffffff" noshade size=1>
		 
		<p><font color="FFFFFF" face="arial">Nachstehend finden Sie eine Dokumentation über das neue Framework "OR-Alpha". <br>In dieser sollen alle Funktionalit&auml;ten 
		sowie die neuen Features kurz aufgezeigt und erkl&auml;rt  werden.</font></p>

		
		<ol><font color="#ffffff" face="arial">
			 <h3><li>Das Framework OR-Alpha</li></h3>
			 <p><font color="#ffffff" face="arial">Auf der unten stehenden Grafik ist das Neue Framework OR-Alpha zu sehen und nebenstehend dieser Grafik<br> sind die Erkl&auml;rungen der einzelnen Bereiche zu finden.<br></font></p>
			 <table>
				<tr>
					<td><img src="or_alpha_framework.JPG" alt="or_alpha_framework" height="250" width="350">&nbsp;&nbsp;&nbsp;</td>
					<td><font color="#ffffff" face="arial"><ul>
															<li>Links oben sind wie gewöhnlich die Reiter "Datei", "Optionen" und "Hilfe" zufinden.</li>
															<li>Direkt darunter auf der linken Seite befindet sich die TreeMap mit einer Auswahl <br> der aktuell eingebundenen Methoden/Solvern.</li>
															<li>Unter der TreeMap sind zwei Buttons zufinden. Der Ausf&uuml;hren button startet die <br>aktuell ausgew&auml;hlte Methode und der Doku Button &ouml;ffnet das Verzeichnis in dem <br> die Dokumentation der jeweiligen Methode zufinden ist.</li>
															<li>Im rechten Bereich des Frameworks OR-Alpha ist ein integriertes Browser-Fenster zusehen,<br> welches eine HTML-Seite mit kurzen Information über die jeweils ausgew&auml;hlte Methode anzeigt.</li>
														   </ul>
					</font></td>
				</tr>

			 </table>
			 <h3><li>Der Reiter "Datei"</li></h3>
			 <table>
				<tr>
					<td><img src="or_alpha_aktualisieren.jpg" alt="or_alpha_aktualisieren">&nbsp;&nbsp;&nbsp;</td>
					<td><font color="#ffffff" face="arial">Durch klicken auf die Funktion "Aktualisieren wird die XML-Datei neu eingelesen, <br>und somit die Treemap mit den Methoden aktualisiert.</font><hr color="ffffff" noshade size=1></td>
				</tr>
				<tr>
					<td><img src="or_alpha_drucken.jpg" alt="or_alpha_drucken">&nbsp;&nbsp;&nbsp;</td>
					<td><font color="#ffffff" face="arial">Mit der Drucken Funktion wird die HTML-Seite der aktuell ausgew&auml;hlten Methode<br> gedruckt.<hr color="ffffff" noshade size=1></font></td>
				</tr>
				<tr>
					<td><img src="or_alpha_neutstart.jpg" alt="or_alpha_neutstart">&nbsp;&nbsp;&nbsp;</td>
					<td><font color="#ffffff" face="arial">Die Neustart-Funktion startet das komplette OR-Alpha-Framework neu.<br><hr color="ffffff" noshade size=1></font></td>
				</tr>
			 </table>
			 <h3><li>Der Reiter "Optionen"</li></h3>
			 <table>
				<tr>
					<td><img src="or_alpha_methodehinzf.jpg" alt="or_alpha_methodehinzufügen">&nbsp;&nbsp;&nbsp;</td>
					<td><font color="#ffffff" face="arial">Mit dieser Funktion können neue Methoden in das Framework OR-Alpha aufgenommen werden. <br>Dazu sp&auml;ter mehr. Nach benutzung dieser Funktion sollte ein Neustart des Frameworks OR-Alpha durchgef&uuml;hrt werden.</font><hr color="ffffff" noshade size=1></td>
				</tr>
				<tr>
					<td><img src="or_alpha_xmlpfad.jpg" alt="or_alpha_xmlpfad">&nbsp;&nbsp;&nbsp;</td>
					<td><font color="#ffffff" face="arial">Unter dieser Funktion wird der aktuelle Pfad zu dem XML-File gesetzt. <br>Nach Benutzung dieser Funktion sollte ein Neustart des Frameworks OR-Alpha durchgef&uuml;hrt werden.</font><hr color="ffffff" noshade size=1></td>
				</tr>
				<tr>
					<td><img src="or_alpha_htmlpfade.jpg" alt="or_alpha_htmlpfade">&nbsp;&nbsp;&nbsp;</td>
					<td><font color="#ffffff" face="arial">Unter dieser Funktion wird der Pfad zu den HTML-Dateien gesetzt. <br>Nach Benutzung dieser Funktion sollte ein Neustart des Frameworks OR-Alpha durchgef&uuml;hrt werden.</font><hr color="ffffff" noshade size=1></td>
				</tr>
				<tr>
					<td><img src="or_alpha_dummy.jpg" alt="or_alpha_dummy">&nbsp;&nbsp;&nbsp;</td>
					<td><font color="#ffffff" face="arial">Unter dieser Funktion wird der Name der Platzhalter HTML-Seite gesetzt.(für Methoden die unter Bearbeitung stehen). <br>Nach benutzung dieser Funktion sollte ein Neustart des Frameworks OR-Alpha durchgef&uuml;hrt werden.</font><hr color="ffffff" noshade size=1></td>
				</tr>
			 </table>
			 <h3><li>Der Reiter "Hilfe"</li></h3>
			 <table>
				<tr>
					<td><img src="or_alpha_helpfile.jpg" alt="or_alpha_helpfile">&nbsp;&nbsp;&nbsp;</td>
					<td><font color="#ffffff" face="arial">Diese Funktion ruft diese Seite auf :P "Saka ya" <br></font><hr color="ffffff" noshade size=1></td>
				</tr>
				<tr>
					<td><img src="or_alpha_info.jpg" alt="or_alpha_info">&nbsp;&nbsp;&nbsp;</td>
					<td><font color="#ffffff" face="arial">&Ouml;ffnet ein neues Fenster mit Informationen &uuml;ber die Copyright-Rechte, Version und die Entwickler. <br></font><hr color="ffffff" noshade size=1></td>
				</tr>
			 </table>
			 <h3><li>Die "TreeMap"</li></h3>
			 <table>
				<tr>
					<td><img src="or_alpha_treemap.JPG" alt="or_alpha_treemap" height="200" width="190">&nbsp;&nbsp;&nbsp;</td>
					<td><font color="#ffffff" face="arial">In der TreeMap "Methodendatenbank" sind 3 Kategorien zu Finden:<br><br>
																<table>
																	<tr>
																		<td><font color="#ffffff" face="arial">Kategorie A&nbsp;&nbsp;&nbsp;</font></td>
																		<td><font color="#ffffff" face="arial">enth&auml;lt Methoden die erfolgreich auf Windows 7/8 migriert wurden<br> und lauff&auml;hig sind.<br></font><hr color="ffffff" noshade size=1></td>
																	</tr>
																	<tr>
																		<td><font color="#ffffff" face="arial">Kategorie B&nbsp;&nbsp;&nbsp;</font></td>
																		<td><font color="#ffffff" face="arial">enth&auml;lt Methoden die von Studenten im Vollzug der Vorlesung <br>"Anwendung der Linearen Optimierung" migriert, aktualisiert oder erweitert wurden.<br></font><hr color="ffffff" noshade size=1></td>
																	</tr>
																	<tr>
																		<td><font color="#ffffff" face="arial">Solver&nbsp;&nbsp;&nbsp;</font></td>
																		<td><font color="#ffffff" face="arial">enth&auml;lt alle Solver und Interaktiven Solver mit denen die Methoden arbeiten.<br> Vorsicht!!! nicht alle Solver/Interaktiven Solver sind ausf&uuml;hrbar da die meisten über kein Frontend verf&uuml;gen.<br> Wir haben in diesen F&auml;llen den Ausf&uuml;hren-Button disabled.</font><hr color="ffffff" noshade size=1></td>
																	</tr>
																</table>
																<br>
																	<ul>
																		<li><font color="#ffffff" face="arial">Durch klicken des Pluszeichens vor der jeweiligen Kategorie, wird diese erweitert und zeigt die jeweils enthaltenen Methoden/Solver an.<br></font></li>
																	</ul>
					</font></td>
				</tr>
			 </table>
			 <h3><li>Eine neue Kategorie/Methode hinzuf&uuml;gen</li></h3>
			 <table>
				<tr>
					<td><img src="or_alpha_neueMethode.JPG" alt="or_alpha_neueMethode" height="300" width="400">&nbsp;&nbsp;&nbsp;</td>
					<td><font color="#ffffff" face="arial"><ul>
															<li>Im Bereich "Einordnung" kann festgelegt werden ob eine Neue Kategorie oder eine neue Methode angelegt werden soll. Wichtig hierbei ist zus&auml;tzlich <br> den richtigen "Parentknoten" auszuw&auml;hlen also den Knoten dem die neue Kategorie/Methode unterstellt werden soll<br><hr color="ffffff" noshade size=1></li>
															<li>Als n&auml;chstes wird der Kategorie/Methoden-Name eingegeben. Wichtig hier bitte darauf achten, dass der Name mit Buchstaben beginnt damit er auch XML-Konform ist.<br> Falls die neue Methode ein Web-Tool ist bitte den Haken bei "Web-Tool" setzen<hr color="ffffff" noshade size=1></li>
															<li>Wenn die ersten Schritte vollzogen sind muss nun der ExecPath angegeben werden, also der Pfad, welcher zu der auf&uuml;hrenden Datei f&uuml;hrt (*.exe,*.jar,*.bat, URL).<br> In dem Feld ist ein Beispielpfad hinterlegt.<hr color="ffffff" noshade size=1></li>
															<li>Als nächstes kann der "DocPath" angegeben werden. Dieser beeinhaltet dasVerzeichnis in dem sich die Dokumentation zu der neuen Methode befinden soll.<br>In dem Feld ist ein Beispielpfad hinterlegt.<hr color="ffffff" noshade size=1></li>
															<li>Mit dem "DataPath" soll der Pfad f&uuml;r das Verzeichnis der Bespieldateien gesetzt werden. Diese Funktion ist noch nicht ausgereift, der Pfad sollte <br> der Ausf&uuml;hrlichkeit trotzdem angegeben werden.In dem Feld ist ein Beispielpfad hinterlegt.<hr color="ffffff" noshade size=1></li>
															<li>Als letztes wird der Name der zugeh&ouml;rigen HTML-Seite angegeben. In dem Feld ist ein Beispielname hinterlegt.<hr color="ffffff" noshade size=1></li>
															</font></td>
				</tr>
			 </table>
		</font></ol>
		<hr color="ffffff" noshade size=1>
		<p><font color="#ffffff" face="arial">Das Framework OR-Alpha enstand im Rahmen eines Teamprojekts im Sommersemester 2013 unter der Leitung des Herrn Prof. Dr. Gr&uuml;tz. Das Framework befindet sich in st&auml;ndiger &Uuml;berarbeitung. Bei Fragen oder Verbesserungsvorschl&auml;gen wenden Sie sich bitte an den Professor der "Operations Research" Vorlesung. <br><br><b> DONE !</b></font><p>
		<hr color="ffffff" noshade size=1>
		<P><FONT color="ffffff" SIZE="-1" face="arial">&#169; 2013 Fachhochschule Konstanz</FONT></P>

	</body>
</html>