<html>
<head>
<title></title>
</head>
<body background="bg.gif" bgproperties="fixed">

<p align="center">
<font face="tahoma,arial" size="+1" color="6080c0">
Beladungsoptimierungsprogramm</font></p>

<p align="center">
<font face="tahoma,arial" size="+1" color="6080c0">
<b>- BOP -</b></font></p>

<hr size="1" noshade>


<FONT face="arial" size="-1">

<p><b>Kurze Funktionsbeschreibung</b>

<p>BOP ist ein Programm zur Beladungsoptimierung im Gütertransport.<br>
Nach der Eingabe verschiedener LKW- und Gebindetypen durch den Benutzer,
sowie deren zu verladende Anzahl, errechnet der Prototyp die optimale 
Beladungsvariante für diesen Transportauftrag und stellt diese auf einer
Auswertungsseite übersichtlich dar.</p>


<p><b>Nutzung des Programms</b>

<P>&Uuml;ber die Register &quot;Eingabe LKWs&quot; und &quot;Eingabe 
Gebinde&quot; k&ouml;nnen die, f&uuml;r die sp&auml;tere Berechnung 
relevanten Daten eingegeben werden.</P>

<P>Im Register &quot;Eingabe LKWs&quot; sind dies:</P>

<UL>
<LI>LKW-Typ: Durchlaufende Nummer, die vom System automatisch gepflegt wird,</LI>
<LI>L&auml;nge; Die L&auml;nge des LKWs (in mm),</LI>
<LI>Breite; Die Breite des LKWs (in mm), </LI>
<LI>H&ouml;he; Die H&ouml;he des LKWs (in mm),</LI>
<LI>Zuladung; Die Zuladung des LKWs (in kg) und</LI>
<LI>Anzahl, die zur Verf&uuml;gung stehende Anzahl dieses LKW-Typs</LI></UL>

<P>Durch einen Klick auf den Button &quot;Weiter&quot; gelangt man in das 
Register Eingabe Gebinde&quot;. Hier sind folgende Daten einzutragen:</P>

<UL>
<LI>Gebinde-Typ: Durchlaufende Nummer, die vom System automatisch gepflegt wird,</LI>
<LI>L&auml;nge; Die L&auml;nge des Gebindes (in mm),</LI>
<LI>Breite; Die Breite des Gebindes (in mm), </LI>
<LI>H&ouml;he; Die H&ouml;he des Gebindes (in mm),</LI>
<LI>Zuladung; Das Gewicht des Gebindes (in kg) und</LI>
<LI>Anzahl, die zu transportierende Menge dieses Gebinde-Typs</LI></UL>


<P>In beiden Eingaberegistern stehen Buttons bereit, um weitere Typen 
einzuf&uuml;gen oder bereits bestehende zu l&ouml;schen. Dabei wird die 
Nummerierung der ersten Spalte immer automatisch mitgepflegt.</P>

<P>Sind alle Daten eingegeben, kann &uuml;ber den Button &quot;Berechnen&quot; 
im Register &quot;Eingabe Gebinde&quot; oder &uuml;ber den Men&uuml;punkt 
&quot;Berechnen&quot; die Berechnung der optimalen L&ouml;sung gestartet werden.</P>

<P>Die Ausgabe der L&ouml;sung erfolgt im Register Ergebnis, in welches nach 
erfolgreicher Berechnung automatisch umgeschaltet wird. Hier ist die Anzahl 
der Spalten dynamisch generiert, da sie von der Anzahl der zu transportierenden 
Gebinde abh&auml;ngt.</P>

<P>In der ersten Spalte steht der verwendete LKW-Typ, gefolgt von der 
benutzten Anzahl in der n&auml;chsten Spalte. Nachfolgend sind dann die zu 
transportierenden Gebinde in der entsprechenden Anzahl aufgef&uuml;hrt.</P>

<br>
</FONT>

</BODY></HTML>
