<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <title>Aufgabe</title>
</head>
<body>

<font face="Arial,Helvetica" color="#666666" size=2>Aufgabenteil 3 
(ehemalige Klausuraufgaben)</font>
<center>
<p><b><font color="#000000" size=+2>Aufgabe 33</font></b></center>

<p><font face="Arial,Helvetica" Size="-1">[WS 96/97 A3]</font>
<hr WIDTH="100%">


<FONT SIZE="2" FACE="Arial">


<p>Ein Betrieb stellt 3 Produkte P1, P2 und P3 her, die 2 Maschinen M1, und M2 
passieren m&uuml;ssen. Die produktionstechnischen Daten gehen aus der folgenden 
Tabelle hervor:

<p>
<table border="1" cellpadding="5" cellspacing="0" align="center" bgcolor="#f9e7cf"
       style="font-size:13">
<tr>
     <td rowspan="2">Maschine</td>
     <td colspan="3">Bearbeitungszeit in h/ME</td>
     <td rowspan="2">Kapazität in h</td>
</tr>
<tr>
     <td align="center">P<sub>1</sub></td>
     <td align="center">P<sub>2</sub></td>
     <td align="center">P<sub>3</sub></td>
</tr>
<tr>
     <td>M<sub>1</sub><p>M<sub>2</sub></p></td>
     <td><p align="center">6</p><p align="center">6</p></td>
     <td><p align="center">2</p><p align="center">2</p></td>
     <td><p align="center">2</p><p align="center">6</p></td>
     <td><p align="center">200</p><p align="center">400</p></td>
</tr>
</table>
 

<p>Die Deckungsbeitr&auml;ge f&uuml;r die 3 Produkte sind 4 GE/ME, 2 GE/ME 
und 3 GE/ME.</p>

<p>Die Planungsabteilung soll der Unternehmensleitung das Produktionsprogramm 
mit dem maximalen Deckungsbeitrag angeben. 

<ol type="a">
<li> Welches Lineare Programm ist zu l&ouml;sen?<br><br> 

<li> Kann man das Lineare Programm graphisch l&ouml;sen?<BR><BR>
<li> L&ouml;sen Sie das Lineare Programm rechnerisch mit Hilfe des 
Simplexverfahrens.<BR><br>
 
<li> Kann man bzgl. der Maschinenkapazit&auml;ten vom Zustand der 
"Vollbesch&auml;ftigung" sprechen?<BR><BR>

<li> Die Unternehmensleitung m&ouml;chte von der Planungsabteilung wissen, 
ob sich eine Kapazitatserweiterung lohnt. Nehmen Sie hierzu Stellung.<BR><br>

<li> Welche Nebenbedingung ist dem Linearen Programm hinzuzuf&uuml;gen, wenn
zus&auml;tzlich zu beachten ist, dass als Mindestproduktion insgesamt 
mindestens 80 ME gefordert werden?<BR><BR> 

<li> Erf&uuml;llt die in c) bestimmte L&ouml;sung auch die neue Nebenbedingung?
<BR><BR>

<li> Welches Problem w&uuml;rde bei der Rechnung in c) auftreten, wenn diese 
neue Nebenbedingung in das Simplextableau mitaufgenommen w&uuml;rde?<BR><BR>

<li> Angenommen, das Lineare Programm wurde unter Einbeziehung der neuen
Nebenbedingung mit Hilfe des Simplexverfahrens gel&ouml;st. W&auml;re dann 
die zugeh&ouml;rige Schlupfvariable der neuen Nebenbedingung in dem optimalen 
Endtableau Basisvariable oder Nichtbasisvariable?<BR><BR>

<li> Angenommen, das Unternehmen w&uuml;rde seine Zielsetzung &auml;ndern und 
nicht mehr eine Maximierung des Deckungsbeitrags anstreben. Statt dessen soll 
als neues Ziel die bestm&ouml;gliche Auslastung der Maschinen erreicht werden. 
Was m&uuml;&szlig;te hierf&uuml;r im Modell von Teilaufgabe a) 
ver&auml;ndert werden? Geben Sie das ver&auml;nderte LP-Modell an!

<p>Zur Kontrolle, das Optimaltableau von Teilaufgabe c) lautet:
<pre style="font-size:13">
3 1 0  3/4 -1/4   50
0 0 1 -1/4  1/4   50
2 0 0  3/4  1/4  250
</pre>

</ol>
<br>

</body>
</html>
