<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
</HEAD>
<BODY background="bg.gif" bgproperties="fixed">

<p align="center">
<font face="tahoma,arial" size="+1" color="#000000">
Schichtenzuordnungsplanung am Beispiel der Dienstplanung im 
Pflegebereich</font></p>

<hr noshade size=1>

<FONT FACE="arial" size="-1">


<h4>Einf&uuml;hrung</A></h4>

<P ALIGN="JUSTIFY">Die Erstellung von Dienstpl&auml;nen in 
Krankenh&auml;usern wird vielfach noch manuell vorgenommen. Dies 
geschieht entweder durch die Station selber, teilweise aber auch 
durch die Pflegedienstleitungen. Die Erstellung eines Dienstplans 
dauert dabei im Schnitt mehrere Stunden oder l&auml;nger, obwohl 
heutzutage auf praktisch jeder Station ein Computer vorhanden ist. 
Zus&auml;tzlich orientieren sich von Hand erstellte Pl&auml;ne oftmals 
an den Pl&auml;nen der letzten Periode. Somit ist es schwierig und 
zeitraubend auf die speziellen W&uuml;nsche der einzelnen 
Pflegekr&auml;fte einzugehen. Des weiteren k&ouml;nnen manuelle 
Pl&auml;ne nicht unbedingt die Anzahl der &Uuml;ber- und Unterstunden
minimieren und optimal verteilen. Dabei k&ouml;nnte die Minimierung 
der &Uuml;berstunden im Pflegesektor relativ einfach Kosten einsparen.</P>

<P ALIGN="JUSTIFY">Da tats&auml;chlich Nachfrage nach einer einfach zu bedienenden und billigen L&ouml;sung besteht, wurde hier versucht eine m&ouml;gliche Implementierung anhand der Linearen Programmierung zu erstellen. </P>


<h4>Regeln zur Dienstplanung</h4>

<P ALIGN="JUSTIFY">Bei der Erstellung von Dienstpl&auml;nen m&uuml;ssen zwei 
verschiedene Arten von Regeln beachtet werden. Einerseits liegen vom 
Gesetzgeber spezielle Regeln zum Arbeitsschutz vor. Andererseits gibt es 
Regeln, die sich von Krankenhaus zu Krankenhaus, sowie teilweise auch 
zwischen verschiedenen Stationen unterscheiden. Hier soll stellvertretend 
auf die Regeln zur Dienstplanerstellung der Neonatologie-Station des 
Krankenhauses in Konstanz eingegangen werden. Dabei sollen f&uuml;r den zu 
erstellenden Prototyp folgende Restriktionen gelten:</P>

<UL>
<P ALIGN="JUSTIFY"><LI>W&uuml;nsche von Mitarbeitern sollen soweit m&ouml;glich ber&uuml;cksichtigt werden (evtl. nach Priorit&auml;t)</LI></P>
<P ALIGN="JUSTIFY"><LI>Urlaub, Fort- und Weiterbildungen m&uuml;ssen eingeplant werden</LI></P>
<P ALIGN="JUSTIFY"><LI>Jedes 2. Wochenende ist frei </LI></P>
<P ALIGN="JUSTIFY"><LI>Schwangere d&uuml;rfen keinen Nachtdienst haben</LI></P>
<P ALIGN="JUSTIFY"><LI>Niemand darf l&auml;nger als 12 Tage am St&uuml;ck arbeiten (Dies trifft automatisch zu, wenn jedes zweite Wochenende frei ist. Dennoch wurde die Restriktion aufgenommen, da es auch Stationen gibt, die nur weniger Tage am St&uuml;ck erlauben oder nicht automatisch jedes zweite Wochenende frei geben. Somit k&ouml;nnte die maximale Anzahl der Tage am St&uuml;ck &uuml;berschritten werden.</LI></P>
<P ALIGN="JUSTIFY"><LI>Nachtdienst</LI></P>

<UL>
<LI>Im Anschluss an einen Nachtdienst sollen immer so viele freie Tage 
folgen, wie Nachtdienst gearbeitet wurde.</LI>
<LI>Mit Nachtdienst d&uuml;rfen nur 10 Tage gearbeitet werden </LI>
</UL>

<P ALIGN="JUSTIFY"><LI>Die Anzahl der &Uuml;ber- oder Minusstunden sollte 
m&ouml;glichst klein gehalten werden</LI></P>
<P ALIGN="JUSTIFY"><LI>Es bestehen drei verschiedene Dienste mit 
verschiedener Stundenanzahl.<BR>
Gewichte der Dienste:</LI></P>

<UL>
  <LI>Nachtschicht = 10 h</LI>
  <LI>Fr&uuml;hschicht&#9;= 8 h </LI>
  <LI>Sp&auml;tschicht&#9;= 8 h</LI>
</UL>

</UL>


<h4>Ausblick</h4>

<P ALIGN="JUSTIFY">Das Programm zeigt deutlich, dass sich Schichtenzuordnungsplanung im Pflegebereich theoretisch realisieren l&auml;sst. Die Restriktionen der linearen Programmierung k&ouml;nnen das Modell zufriedenstellend abbilden. Allerdings reichen die gestesteten Solver (und somit die zugrundeliegenden Algorithmen) f&uuml;r den praktischen Einsatz nicht aus. Dabei scheint der Simplexalgorithmus, sowie das Interior point optimization Verfahren gen&uuml;gend schnell. Das Problem liegt damit bei den wesentlich schwieriger zu findenden ganzzahligen L&ouml;sungen und damit beim zu langsamen Dakinschen Entscheidungsbaum-Verfahren.</P>
<P ALIGN="JUSTIFY">Andere Ans&auml;tze und Techniken scheinen f&uuml;r diesen Bereich vielversprechender. So gibt es eine softwaretechnische L&ouml;sung zur Schichtenzuordnungsplanung im Pflegebereich namens ConPlan/ORBIS vom Deutschen Forschungszentrum f&uuml;r K&uuml;nstliche Intelligenz. Diese Software benutzt zur L&ouml;sung des Problems Suchb&auml;ume mit Bound&amp;Cut Verfahren, welche zus&auml;tzlich durch Heuristiken unterst&uuml;tzt werden. Eine anderer L&ouml;sungsansatz f&uuml;r den Bereich der Schichtenzuordnungsplanung, kommt aus dem Bereich der Genetischen Algorithmen. </P>

</FONT>

<hr noshade size=1>
<FONT SIZE="-2" face="arial">&#169; &nbsp;Fachhochschule Konstanz</FONT>

</BODY>
</HTML>
